mermaid upgrade
